#+TITLE:     Scientific Methodology and Performance Evaluation for Computer Scientists
#+AUTHOR:    Arnaud Legrand
#+DATE: August 2015
#+STARTUP: overview indent

[[http://creativecommons.org/licenses/by/4.0/][https://img.shields.io/badge/License-CC%20BY%204.0-lightgrey.svg]]

#+BEGIN_QUOTE
*Reporting errors*: Although I do my best there may definitely be typos
and broken links. This is github so please report me anything you
find so that I can improve for others. :)
#+END_QUOTE

This website gather the series of lectures on applied performance
evaluation avalaible that I was invited to give in various
occasions. I have given this course with Jean-Marc Vincent several
years (roughly from 2011 to 2015) in the second year of the [[http://mosig.imag.fr/][Master of
Science in Informatics at Grenoble]] and more recently at [[http://www.ufrgs.br/][Federal
University of Rio Grande do Sul]], at [[http://www.ens-lyon.fr][ENS Lyon]] and [[http://ens-rennes.fr][ENS Rennes]]. Most sessions I gave are listed [[file:sessions/][here]].

#+begin_center
*If you are a MOSIG student, the webpage for your session is [[file:sessions/2024_10_Grenoble/README.org][here]]*.
#+end_center

This website also gathers a list of keynotes I gave on reproducible
research. The most recent ones are:
#+begin_src shell :results output raw :exports results
for i in `ls lectures/talk*.pdf | sort -r | head -n 9`;  do
    date=`echo $i | sed 's/.*talk_//'`;
    place=$date;
    date=`echo $date | sed 's/_[^0-9].*//g'`;
    date=`echo $date | sed 's|\([0-9]*\)_\([0-9]*\)_\([0-9]*\)|\3/\2/20\1|g'`;
    place=`echo $place | sed -e s/[0-9_]*// -e 's/.pdf//'`;
    echo - [[file:$i][$place \($date\)]];
done
#+end_src

#+RESULTS:
- [[file:lectures/talk_24_12_11_M1_UGA.pdf][M1_UGA (11/12/2024)]]
- [[file:lectures/talk_24_11_27_theory_days.pdf][theory_days (27/11/2024)]]
- [[file:lectures/talk_24_03_27_Journees_reseau_recherche_reproductible_table_ronde_IA.pdf][Journees_reseau_recherche_reproductible_table_ronde_IA (27/03/2024)]]
- [[file:lectures/talk_24_03_15_ORAP_2.pdf][ORAP_2 (15/03/2024)]]
- [[file:lectures/talk_24_03_15_ORAP_1.pdf][ORAP_1 (15/03/2024)]]
- [[file:lectures/talk_24_02_07_RSD_School_Pleynet.pdf][RSD_School_Pleynet (07/02/2024)]]
- [[file:lectures/talk_24_01_24_L3_ENSL.pdf][L3_ENSL (24/01/2024)]]
- [[file:lectures/talk_23_12_14_M1_UGA.pdf][M1_UGA (14/12/2023)]]
- [[file:lectures/talk_23_10_18_Bordeaux_Neurocampus.pdf][Bordeaux_Neurocampus (18/10/2023)]]

** Installing R and Rstudio
Here is how to proceed on debian-based distributions:
#+BEGIN_SRC sh
sudo apt-get install r-base r-cran-ggplot2 r-cran-reshape 
#+END_SRC
Make sure you have a recent (>= 3.2.0) version or R. For example, here
is what I have on my machine:
#+begin_src sh :results output :exports both
R --version
#+end_src

#+RESULTS:
#+begin_example
R version 3.2.0 (2015-04-16) -- "Full of Ingredients"
Copyright (C) 2015 The R Foundation for Statistical Computing
Platform: x86_64-pc-linux-gnu (64-bit)

R is free software and comes with ABSOLUTELY NO WARRANTY.
You are welcome to redistribute it under the terms of the
GNU General Public License versions 2 or 3.
For more information about these matters see
http://www.gnu.org/licenses/.
#+end_example

Rstudio and knitr are unfortunately not packaged within debian so the
easiest is to download the corresponding debian package on the [[http://www.rstudio.com/ide/download/desktop][Rstudio
webpage]] and then to install it manually (depending on when you do
this, you can obviously change the version number).

#+BEGIN_SRC sh
wget http://download1.rstudio.org/rstudio-0.99.484-amd64.deb
sudo dpkg -i rstudio-0.99.484-amd64.deb
sudo apt-get -f install # to fix possibly missing dependencies
#+END_SRC
You will also need to install knitr. To this end, you should simply
run R (or Rstudio) and use the following command.
#+BEGIN_SRC R
install.packages("knitr")
#+END_SRC
If =r-cran-ggplot2= or =r-cran-reshape= could not be installed for some
reason, you can also install it through R by doing:
#+BEGIN_SRC R
install.packages("ggplot2")
install.packages("reshape")
#+END_SRC
